[{"title":"Electron Quick Start","date":"2018-01-06T14:41:44.000Z","path":"2018/01/06/Electron-Quick-Start/","text":"Electron is a good choice to build cross platform desktop apps with JavaScript, HTML, and CSS. In this article, I will guide you to install all necessary packages, get electron-quick-start running and create the dist package. node.jsFirst, you need install node.js. The v6.9.1 is used in my case. 12$ node --versionv6.9.1 Fetch code1git clone https://github.com/electron/electron-quick-start.git Install packages and run123cd electron-quick-startnpm installnpm start In China, the installation process may suspend due to the problem of downloading electron binary package (version 1.7.10 in my case), even with taobao registry enabled. One possible workaround is fetching the package directly and put in the cache directory, so the script install.js can uncompress the package without downloading. 12cd ~/.electronwget https://npm.taobao.org/mirrors/electron/1.7.10/electron-v1.7.10-darwin-x64.zip Create the dist package1electron-packager electron-quick-start/ quick-start","tags":[]},{"title":"About Lambda Architecture","date":"2017-03-18T16:02:58.000Z","path":"2017/03/19/About-Lambda-Architecture/","text":"Lambda architecture includes three layers: Batch layer Speed layer Serving layer The explanation from Wiki","tags":[{"name":"programming","slug":"programming","permalink":"http://fox000002.github.io/PyCleverAlgorithms/tags/programming/"}]},{"title":"console-logging-in-javascript","date":"2016-05-14T14:53:11.000Z","path":"2016/05/14/console-logging-in-javascript/","text":"Today, I watched the 7 lesson of “Advanced Logging with the JavaScript Console“. My debugging skill with JavaScript console was enhanced a lot. Log levels12345console.log()console.warn()console.error()console.info()console.debug() Log argumentsWe can use the similar formatting in printf of C. 1console.log('Your age is %d', 5) Grouping and nestingWe group outputs by name. 12console.group(\"GroupName\");console.groupEnd(\"GroupName\"); AssertWe can make some assertions with function assert. But it does not mean the error is handled. 1console.assert(info) CountWe can count outputs with function count. 1console.count(\"name\") Timing12console.time(\"name\");console.timeEnd(\"name\"); Table1console.table(obj)","tags":[]},{"title":"Hello World","date":"2016-05-14T14:06:58.000Z","path":"2016/05/14/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]